<?php

if (!function_exists('color_diff')) {
    function color_diff($clr1) {


        $color_s = [
            "#FFCB04" => "#000000",
            "#89D0CE" => "#000000",
            "#E4EFF5" => "#000000",
            "#E3E7EF" => "#000000",
            "#F3F3F5" => "#000000",
            "#E0E1E3" => "#000000",
            "#D8DF20" => "#000000",
            "#FFDE01" => "#000000",
            "#E8E9ED" => "#000000",
            "#E8E9EB" => "#000000",
            "#E1E6ED" => "#000000",
            "#FAB347" => "#000000",
            "#E8E9ED" => "#000000",
            "#D3D3D3" => "#000000",
            "#FCEDEA" => "#000000",
            "#BFE4EA" => "#000000",
            "#FED600" => "#000000",
        ];

        return (isset($color_s[strtoupper($clr1)]))?$color_s[strtoupper($clr1)]:"#FFFFFF";
    }
}

// Месяц текстом
if (!function_exists("get_month")) {
    function get_month($date) {
        $monthes = array(
            1 => 'января', 2 => 'февраля', 3 => 'марта', 4 => 'апреля',
            5 => 'мая', 6 => 'июня', 7 => 'июля', 8 => 'августа',
            9 => 'сентября', 10 => 'октября', 11 => 'ноября', 12 => 'декабря'
        );
        return $monthes[(date('n', strtotime($date)))];
    }
}

// Форматирование номера телефона

if (!function_exists("phone_format")) {
    function phone_format($phone)
    {
        $phone = trim($phone);

        $res = preg_replace(
            array(
                '/[\+]?([7|8])[-|\s]?\([-|\s]?(\d{3})[-|\s]?\)[-|\s]?(\d{3})[-|\s]?(\d{2})[-|\s]?(\d{2})/',
                '/[\+]?([7|8])[-|\s]?(\d{3})[-|\s]?(\d{3})[-|\s]?(\d{2})[-|\s]?(\d{2})/',
                '/[\+]?([7|8])[-|\s]?\([-|\s]?(\d{4})[-|\s]?\)[-|\s]?(\d{2})[-|\s]?(\d{2})[-|\s]?(\d{2})/',
                '/[\+]?([7|8])[-|\s]?(\d{4})[-|\s]?(\d{2})[-|\s]?(\d{2})[-|\s]?(\d{2})/',
                '/[\+]?([7|8])[-|\s]?\([-|\s]?(\d{4})[-|\s]?\)[-|\s]?(\d{3})[-|\s]?(\d{3})/',
                '/[\+]?([7|8])[-|\s]?(\d{4})[-|\s]?(\d{3})[-|\s]?(\d{3})/',
            ),
            array(
                '$2$3$4$5',
                '$2$3$4$5',
                '$2$3$4$5',
                '$2$3$4$5',
                '$2$3$4',
                '$2$3$4',
            ),
            $phone
        );

        return $res;
    }
}
